Ext.define("Message.resource.LocaleCode", {
	
	statics : {
		//消息代码
		MsgCode : {
			//普通信息框
			info : {
				_title : "提示",							
				I0101: "保存成功",
				I0102: "更新成功",
				I0103: "删除成功",
				I0104: "重置密码成功。",
				I0105: "修改密码成功。"
			},
			//警告信息框
			warn:{
				_title : "警告",	
				W0101: "请选择一条记录编辑！",
				W0102: "请选择一条记录删除！"	
			},
			//错误信息框
			error : {
				_title: "错误",
				E0001: "无效的消息代码-[{0}]",
				E0101: "保存失败",
				E0102: "更新失败",
				E0103: "删除失败",
				E0104: "请求超时",
				E0105: "用户名密码错误",
				E0106: "会话超时，请重新登录",
				E0107: "登录失败-[{0}]"
			},
			//等待确认信息框
			confirm : {
				_title: "确认",
				C0101: "您确认删除当前选中记录吗？",
				C0102: "您确认删除当前选中节点[{0}]吗？"
			}
		}
	}
});